{
    "inputs": [
      {
        "lang": "sanskrit",
        "original": "सर्वज्ञाय नमस्कृत्य द्रव्याणां गूढवाचिनाम्\nअष्टाङ्गसंग्रहोक्तानां निघण्टुर् अभिधीयते",
        "english": "Salutations to the all-knowing one, who possesses the secret knowledge of substances. The compilation of the eight branches of knowledge is called Nighantu."
      },
      {
        "lang": "sanskrit",
        "original": "विदारीपञ्चाङ्गुलवृश्चिकालीवृश्चीवदेवाह्वयशूर्पपर्ण्यः\nकण्डूकरी जीवनाह्वस्वसंज्ञे द्वे पञ्चके गोपसुता त्रिपादी",
        "english": "The Vidārī plant twigs and the rain boiled in a vessel; Deva Ahvaya Shūrpaparṇya's daughter Gopasutā of the Tṛipādī (three-legged) clan"
      },
      {
        "lang": "sanskrit",
        "original": "आग्नावैष्णवम् पुरोﾱआशं निर्वपन्ति दीक्षणीयम् एकादशकपालम्",
        "english": "This verse describes a ritualistic practice where a sacrificial being called Agnavaishnavam purosha is placed in front of the sacred fire. The offering made during this ritual is called Ekadashakapala, which consists of eleven cups. This verse highlights the importance of fire and rituals in the Vedic tradition."
      },
      {
        "lang": "sanskrit",
        "original": "व्युत्पत्तिरहिताः शब्दा रूढा आखण्डलादयः\nयोगो ऽन्वयः स तु गुणक्रियासंबन्धसंभवः",
        "english": "Words devoid of origin are considered as basic and unsplit. The connected relationship between quality, action, and substance is known as yoga."
      },
      {
        "lang": "sanskrit",
        "original": "प्रणिपत्यार्हतः सिद्धसाङ्गशब्दानुशासनः रूढयौगिकमिश्राणां नाम्नां मालां तनोम्यहम्",
        "english": "I offer my respectful obeisances to the one who is worthy of worship, the siddha (accomplished) sage, who is expert in the teachings of the scriptures. I now expand the garland of names of the mixed forms of yoga."
      },
      {
        "lang": "sanskrit",
        "original": "शालिशेखरमत्वर्थमालिभर्तृधरा अपि भोज्याद् भुगन्धोव्रतलिट्पायिपाशाशनादयः",
        "english": "Even the bees, butterflies, ants, beetles, and other insects, captivated by the fragrance of the flowers, become enamored with the beauty of the crest jewel of peacocks."
      },
      {
        "lang": "sanskrit",
        "original": "शिक्षा कल्पो व्याकरणं निरुक्तं ज्योतिषां गतिः छन्दो ऽभिधानं मीमांसा धर्मशास्त्रं पुराणकम्",
        "english": "Shiksha (Phonetics) is the science of pronunciation, Kalpa (Rituals) deals with the rules for rituals, Vyakarana (Grammar) is the study of grammar, Nirukta (Etymology) explains the meaning of words, Jyotisha (Astrology) is the study of celestial bodies and their influence, Chanda (Prosody) deals with the rules of meter, Abhidhana (Lexicography) is the compilation of dictionaries, Mimamsa (Interpretation) is the study of interpretation of scriptures, Dharma Shastra (Law) deals with the rules of conduct, and Purana (Mythology) contains ancient stories and legends."
      },
      {
        "lang": "sanskrit",
        "original": "यत्तददृश्यमग्राह्यम् अगोत्रचरणम् ध्रुवम् विष्णुनोक्तं यथा मह्यं देवेभ्यो ब्रह्मणा पुरा तथा ते कथयिष्यामि हेतुं मत्स्यादिरूपिणम्",
        "english": "That which is invisible, ungraspable, without lineage, and eternal. Just as Lord Vishnu explained to me in the past, I will now tell you the reason behind my manifestation in the form of a fish and other avatars."
      },
      {
        "lang": "sanskrit",
        "original": "रामदूतो राघवाय सीतां देहि मरिष्यसि रामबाणैर् हतः सार्धं लङ्कास्थै राक्षसैर् ध्रुवम्",
        "english": "O messenger of Rama, give Sita to Rama, otherwise you will die. Ravana, along with the demons in Lanka, was certainly killed by Rama's arrows."
      },
      {
        "lang": "sanskrit",
        "original": "धर्माणां प्रविचयमन्तरेण नास्ति क्लेशानां यत उपशान्तयेऽभ्युपायः क्लेशैश्च भ्रमति भवार्णवेऽत्र लोकस्तद्धेतोरत उदितः किलैष शास्त्रा",
        "english": "There is no other way to alleviate the sufferings of beings than through the realization of the true nature of dharma. In this ocean of existence, beings are bewildered by their sufferings. The scriptures proclaim that the ultimate solution lies in the understanding of dharma."
      },
      {
        "lang": "sanskrit",
        "original": "भवाग्रजाः क्षान्तिवध्य दृग्घेया एव शेषजाः दृग्भावनाभ्याम् अक्षान्तिवध्या भावनयैव तु",
        "english": "The foremost among qualities is patience, as it alone remains after all other qualities perish. Through the cultivation of patience, one can overcome all obstacles."
      }
    ]
  }
